lab/reports/workload/20260808T174825Z/fio-noise.txt
=== fio noise: b-stress (60 seconds) ===
solis-noise: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.36
Starting 4 processes

solis-noise: (groupid=0, jobs=4): err= 0: pid=2968: Sat Aug  8 17:49:32 2026
  write: IOPS=59.9k, BW=234MiB/s (245MB/s)(13.7GiB/60001msec); 0 zone resets
    slat (usec): min=3, max=3285, avg=47.81, stdev=82.54
    clat (nsec): min=921, max=925860k, avg=2085607.35, stdev=6669463.81
     lat (usec): min=23, max=926134, avg=2133.42, stdev=6669.33
    clat percentiles (usec):
     |  1.00th=[  529],  5.00th=[ 1123], 10.00th=[ 1467], 20.00th=[ 1696],
     | 30.00th=[ 1811], 40.00th=[ 1893], 50.00th=[ 1975], 60.00th=[ 2073],
     | 70.00th=[ 2212], 80.00th=[ 2409], 90.00th=[ 2704], 95.00th=[ 2999],
     | 99.00th=[ 3720], 99.50th=[ 4080], 99.90th=[ 4817], 99.95th=[ 5145],
     | 99.99th=[ 6980]
   bw (  KiB/s): min=34288, max=283488, per=100.00%, avg=241579.93, stdev=10158.78, samples=472
   iops        : min= 8572, max=70872, avg=60394.59, stdev=2539.68, samples=472
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 10=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.85%, 750=1.49%, 1000=1.65%
  lat (msec)   : 2=49.08%, 4=46.33%, 10=0.59%, 20=0.01%, 750=0.01%
  lat (msec)   : 1000=0.01%
  cpu          : usr=2.96%, sys=16.93%, ctx=2401247, majf=0, minf=49
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3593421,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=234MiB/s (245MB/s), 234MiB/s-234MiB/s (245MB/s-245MB/s), io=13.7GiB (14.7GB), run=60001-60001msec

Disk stats (read/write):
  vda: ios=0/3586074, sectors=0/28712824, merge=0/2962, ticks=0/317151, in_queue=318703, util=84.86%